Microchip-MPLAB-Harmony/csp/apps/sdramc/sdramc_read_write/firmware/src/packs/ATSAMV71Q21B_DFP/component/ssc.h
/* -------- SSC_WPMR : (SSC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define SSC_WPMR_WPEN_Pos                     (0U)                                           /**< (SSC_WPMR) Write Protection Enable Position */
#define SSC_WPMR_WPEN_Msk                     (0x1U << SSC_WPMR_WPEN_Pos)                    /**< (SSC_WPMR) Write Protection Enable Mask */
#define SSC_WPMR_WPEN(value)                  (SSC_WPMR_WPEN_Msk & ((value) << SSC_WPMR_WPEN_Pos))
#define SSC_WPMR_WPKEY_Pos                    (8U)                                           /**< (SSC_WPMR) Write Protection Key Position */
#define SSC_WPMR_WPKEY_Msk                    (0xFFFFFFU << SSC_WPMR_WPKEY_Pos)              /**< (SSC_WPMR) Write Protection Key Mask */
#define SSC_WPMR_WPKEY(value)                 (SSC_WPMR_WPKEY_Msk & ((value) << SSC_WPMR_WPKEY_Pos))
#define   SSC_WPMR_WPKEY_PASSWD_Val           (5460803U)                                     /**< (SSC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define SSC_WPMR_WPKEY_PASSWD                 (SSC_WPMR_WPKEY_PASSWD_Val << SSC_WPMR_WPKEY_Pos) /**< (SSC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define SSC_WPMR_Msk                          (0xFFFFFF01UL)                                 /**< (SSC_WPMR) Register Mask  */

/* -------- SSC_WPSR : (SSC Offset: 0xE8) (R/  32) Write Protection Status Register -------- */
#define SSC_WPSR_WPVS_Pos                     (0U)                                           /**< (SSC_WPSR) Write Protection Violation Status Position */
#define SSC_WPSR_WPVS_Msk                     (0x1U << SSC_WPSR_WPVS_Pos)                    /**< (SSC_WPSR) Write Protection Violation Status Mask */
#define SSC_WPSR_WPVS(value)                  (SSC_WPSR_WPVS_Msk & ((value) << SSC_WPSR_WPVS_Pos))
#define SSC_WPSR_WPVSRC_Pos                   (8U)                                           /**< (SSC_WPSR) Write Protect Violation Source Position */
#define SSC_WPSR_WPVSRC_Msk                   (0xFFFFU << SSC_WPSR_WPVSRC_Pos)               /**< (SSC_WPSR) Write Protect Violation Source Mask */
#define SSC_WPSR_WPVSRC(value)                (SSC_WPSR_WPVSRC_Msk & ((value) << SSC_WPSR_WPVSRC_Pos))
#define SSC_WPSR_Msk                          (0x00FFFF01UL)                                 /**< (SSC_WPSR) Register Mask  */

/** \brief SSC register offsets definitions */
#define SSC_CR_OFFSET                  (0x00)         /**< (SSC_CR) Control Register Offset */
#define SSC_CMR_OFFSET                 (0x04)         /**< (SSC_CMR) Clock Mode Register Offset */
#define SSC_RCMR_OFFSET                (0x10)         /**< (SSC_RCMR) Receive Clock Mode Register Offset */
#define SSC_RFMR_OFFSET                (0x14)         /**< (SSC_RFMR) Receive Frame Mode Register Offset */
#define SSC_TCMR_OFFSET                (0x18)         /**< (SSC_TCMR) Transmit Clock Mode Register Offset */
#define SSC_TFMR_OFFSET                (0x1C)         /**< (SSC_TFMR) Transmit Frame Mode Register Offset */
#define SSC_RHR_OFFSET                 (0x20)         /**< (SSC_RHR) Receive Holding Register Offset */
#define SSC_THR_OFFSET                 (0x24)         /**< (SSC_THR) Transmit Holding Register Offset */
#define SSC_RSHR_OFFSET                (0x30)         /**< (SSC_RSHR) Receive Sync. Holding Register Offset */
#define SSC_TSHR_OFFSET                (0x34)         /**< (SSC_TSHR) Transmit Sync. Holding Register Offset */
#define SSC_RC0R_OFFSET                (0x38)         /**< (SSC_RC0R) Receive Compare 0 Register Offset */
#define SSC_RC1R_OFFSET                (0x3C)         /**< (SSC_RC1R) Receive Compare 1 Register Offset */
#define SSC_SR_OFFSET                  (0x40)         /**< (SSC_SR) Status Register Offset */
#define SSC_IER_OFFSET                 (0x44)         /**< (SSC_IER) Interrupt Enable Register Offset */
#define SSC_IDR_OFFSET                 (0x48)         /**< (SSC_IDR) Interrupt Disable Register Offset */
#define SSC_IMR_OFFSET                 (0x4C)         /**< (SSC_IMR) Interrupt Mask Register Offset */
#define SSC_WPMR_OFFSET                (0xE4)         /**< (SSC_WPMR) Write Protection Mode Register Offset */
#define SSC_WPSR_OFFSET                (0xE8)         /**< (SSC_WPSR) Write Protection Status Register Offset */

/** \brief SSC register API structure */
typedef struct
{
  __O   uint32_t                       SSC_CR;          /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       SSC_CMR;         /**< Offset: 0x04 (R/W  32) Clock Mode Register */
  __I   uint8_t                        Reserved1[0x08];
  __IO  uint32_t                       SSC_RCMR;        /**< Offset: 0x10 (R/W  32) Receive Clock Mode Register */
  __IO  uint32_t                       SSC_RFMR;        /**< Offset: 0x14 (R/W  32) Receive Frame Mode Register */
  __IO  uint32_t                       SSC_TCMR;        /**< Offset: 0x18 (R/W  32) Transmit Clock Mode Register */
  __IO  uint32_t                       SSC_TFMR;        /**< Offset: 0x1c (R/W  32) Transmit Frame Mode Register */
  __I   uint32_t                       SSC_RHR;         /**< Offset: 0x20 (R/   32) Receive Holding Register */
  __O   uint32_t                       SSC_THR;         /**< Offset: 0x24 ( /W  32) Transmit Holding Register */
  __I   uint8_t                        Reserved2[0x08];
  __I   uint32_t                       SSC_RSHR;        /**< Offset: 0x30 (R/   32) Receive Sync. Holding Register */
  __IO  uint32_t                       SSC_TSHR;        /**< Offset: 0x34 (R/W  32) Transmit Sync. Holding Register */
  __IO  uint32_t                       SSC_RC0R;        /**< Offset: 0x38 (R/W  32) Receive Compare 0 Register */
  __IO  uint32_t                       SSC_RC1R;        /**< Offset: 0x3c (R/W  32) Receive Compare 1 Register */
  __I   uint32_t                       SSC_SR;          /**< Offset: 0x40 (R/   32) Status Register */
  __O   uint32_t                       SSC_IER;         /**< Offset: 0x44 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       SSC_IDR;         /**< Offset: 0x48 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       SSC_IMR;         /**< Offset: 0x4c (R/   32) Interrupt Mask Register */
  __I   uint8_t                        Reserved3[0x94];
  __IO  uint32_t                       SSC_WPMR;        /**< Offset: 0xe4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       SSC_WPSR;        /**< Offset: 0xe8 (R/   32) Write Protection Status Register */
} ssc_registers_t;
/** @}  end of Synchronous Serial Controller */

#endif /* SAMV_SAMV71_SSC_MODULE_H */

